/*
 * 【未実装の項目】
 * 
 * （済）（ちゃんと）リロードするシステム
 * （済）ショップのレベルを変更するシステム
 * （済）ショップの説明を表示する機能
 * （済）キーの数でゴールが有効かどうかを判断するシステム
 * （済）ダメージエフェクト
 * （済）キルログ
 * （済）サバイバル挑戦中の記録をとるシステム
 * （済）サーフマップ
 * （済）メニュー
 * （済）セッティングウィンドウ
 * （済）システム音
 * （済）「調べる」を押してアイテムを取得するシステム
 * （済）ダメージが正しく計算されているかを確認するためのシステム
 * （済）タイムアップのしくみ
 * ・最初のステージ
 * ・コマンドの説明
 * ・遊び方の説明
 * ・プレイヤーの動きを記録し，テキスト出力するシステム（レコーダー）
 * ・Invalid Area に入った時に戻るシステム
 * ・神視点モード
 * ・リプレイ機能
 * ・ゴーストのリプレイ機能
 * ・難易度調整
 * 
 * 【キャンバスの層】
 * 
 */

